monsantoDocs/Product-availability-response-NOT_IMPLEMENTED_YET.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <ag:outboundData xmlns:ag="urn:aggateway:names:ws:docexchange">
            <ag:processStep>PriceAndAvailabilityResponse53</ag:processStep>
            <ag:messageId/>
            <ag:xmlPayload>
                <urn:PriceAndAvailabilityResponse xmlns:urn="urn:cidx:names:specification:ces:schema:all:5:3" Version="5.3">
                    <urn:Header>
                        <urn:ThisDocumentIdentifier>
                            <urn:DocumentIdentifier>0Ehm4S1PgCK3h54kovEb9g==</urn:DocumentIdentifier>
                        </urn:ThisDocumentIdentifier>
                        <urn:ThisDocumentDateTime>
                            <urn:DateTime DateTimeQualifier="On">2019-06-28T23:06:21Z</urn:DateTime>
                        </urn:ThisDocumentDateTime>
                        <urn:From>
                            <urn:PartnerInformation>
                                <urn:PartnerName>MONSANTO AGRICULTURAL CO</urn:PartnerName>
                                <urn:PartnerIdentifier Agency="AGIIS-EBID">0062668030000</urn:PartnerIdentifier>
                            </urn:PartnerInformation>
                        </urn:From>
                        <urn:To>
                            <urn:PartnerInformation>
                                <urn:PartnerName>SHAWN SULLIVAN SEED</urn:PartnerName>
                                <urn:PartnerIdentifier Agency="AGIIS-EBID">1100032937530</urn:PartnerIdentifier>
                            </urn:PartnerInformation>
                        </urn:To>
                    </urn:Header>
                    <urn:PriceAndAvailabilityResponseBody>
                        <urn:PriceAndAvailabilityResponseProperties>
                            <urn:RequisitionNumber>
                                <urn:DocumentIdentifier>a</urn:DocumentIdentifier>
                            </urn:RequisitionNumber>
                            <urn:RequisitionTypeCode Domain="ANSI-ASC-X12-92">DEALRPAL</urn:RequisitionTypeCode>
                            <urn:LanguageCode Domain="ISO-639-2T">eng</urn:LanguageCode>
                            <urn:CurrencyCode Domain="ISO-4217">USD</urn:CurrencyCode>
                        </urn:PriceAndAvailabilityResponseProperties>
                        <urn:PriceAndAvailabilityResponsePartners>
                            <urn:Buyer>
                                <urn:PartnerInformation>
                                    <urn:PartnerName>SHAWN SULLIVAN SEED</urn:PartnerName>
                                    <urn:PartnerIdentifier Agency="AssignedByPapiNet">0003350963</urn:PartnerIdentifier>
                                </urn:PartnerInformation>
                            </urn:Buyer>
                            <urn:Seller>
                                <urn:PartnerInformation>
                                    <urn:PartnerName>MONSANTO AGRICULTURAL CO</urn:PartnerName>
                                    <urn:PartnerIdentifier Agency="AGIIS-EBID">0062668030000</urn:PartnerIdentifier>
                                </urn:PartnerInformation>
                            </urn:Seller>
                            <urn:ShipTo>
                                <urn:PartnerInformation>
                                    <urn:PartnerName>SHAWN SULLIVAN SEED</urn:PartnerName>
                                    <urn:PartnerIdentifier Agency="AssignedByPapiNet">0003350963</urn:PartnerIdentifier>
                                </urn:PartnerInformation>
                            </urn:ShipTo>
                            <urn:Payer>
                                <urn:PartnerInformation>
                                    <urn:PartnerName>SHAWN SULLIVAN SEED</urn:PartnerName>
                                    <urn:PartnerIdentifier Agency="AGIIS-EBID">1100032937530</urn:PartnerIdentifier>
                                </urn:PartnerInformation>
                            </urn:Payer>
                        </urn:PriceAndAvailabilityResponsePartners>
                        <urn:PriceAndAvailabilityResponseDetails>
                            <urn:PriceAndAvailabilityResponseProductLineItem>
                                <urn:LineNumber>1</urn:LineNumber>
                                <urn:RequisitionLineItemNumber>1</urn:RequisitionLineItemNumber>
                                <urn:ProductIdentification>
                                    <urn:ProductIdentifier Agency="UPC">883580840033</urn:ProductIdentifier>
                                    <urn:Trademark>SB9</urn:Trademark>
                                    <urn:ProductDescription>CORN</urn:ProductDescription>
                                    <urn:ProductGradeDescription>DKC61-79RIB</urn:ProductGradeDescription>
                                    <urn:ProductClassification>C</urn:ProductClassification>
                                </urn:ProductIdentification>
                                <urn:ProductIdentification>
                                    <urn:ProductIdentifier Agency="AGIIS-ProductID">00883580840033</urn:ProductIdentifier>
                                </urn:ProductIdentification>
                                <urn:ProductQuantityInformation>
                                    <urn:Comment>
                                        <urn:Content>500 or more</urn:Content>
                                    </urn:Comment>
                                </urn:ProductQuantityInformation>
                                <urn:ProductCharacteristics Agency="ATPOrAllocationIndicator">ATP</urn:ProductCharacteristics>
                                <urn:ProductCharacteristics Agency="Maturity">111</urn:ProductCharacteristics>
                                <urn:ProductCharacteristics Agency="ProductAllocation">US_ALLOC</urn:ProductCharacteristics>
                                <urn:ScheduleDateTimeInformation ScheduleType="RequestedDelivery">
                                    <urn:DateTimeInformation>
                                        <urn:DateTime DateTimeQualifier="On">2019-06-28T23:06:21Z</urn:DateTime>
                                    </urn:DateTimeInformation>
                                </urn:ScheduleDateTimeInformation>
                                <urn:ProductQuantity>
                                    <urn:Measurement>
                                        <urn:MeasurementValue>5336.000</urn:MeasurementValue>
                                        <urn:UnitOfMeasureCode Domain="UN-Rec-20">BG</urn:UnitOfMeasureCode>
                                    </urn:Measurement>
                                </urn:ProductQuantity>
                            </urn:PriceAndAvailabilityResponseProductLineItem>
                            <urn:PriceAndAvailabilityResponseProductLineItem>
                                <urn:LineNumber>2</urn:LineNumber>
                                <urn:RequisitionLineItemNumber>2</urn:RequisitionLineItemNumber>
                                <urn:ProductIdentification>
                                    <urn:ProductIdentifier Agency="UPC">888346610608</urn:ProductIdentifier>
                                    <urn:Trademark>SC2</urn:Trademark>
                                    <urn:ProductDescription>SOYBEAN</urn:ProductDescription>
                                    <urn:ProductGradeDescription>AG27X8</urn:ProductGradeDescription>
                                    <urn:ProductClassification>B</urn:ProductClassification>
                                </urn:ProductIdentification>
                                <urn:ProductIdentification>
                                    <urn:ProductIdentifier Agency="AGIIS-ProductID">00888346610608</urn:ProductIdentifier>
                                </urn:ProductIdentification>
                                <urn:ProductQuantityInformation>
                                    <urn:Comment>
                                        <urn:Content>1000 or more</urn:Content>
                                    </urn:Comment>
                                </urn:ProductQuantityInformation>
                                <urn:ProductCharacteristics Agency="ATPOrAllocationIndicator">ALC</urn:ProductCharacteristics>
                                <urn:ProductCharacteristics Agency="Maturity">2.7</urn:ProductCharacteristics>
                                <urn:ProductCharacteristics Agency="ProductAllocation">US_ALLOC</urn:ProductCharacteristics>
                                <urn:ScheduleDateTimeInformation ScheduleType="RequestedDelivery">
                                    <urn:DateTimeInformation>
                                        <urn:DateTime DateTimeQualifier="On">2019-06-28T23:06:21Z</urn:DateTime>
                                    </urn:DateTimeInformation>
                                </urn:ScheduleDateTimeInformation>
                                <urn:ProductQuantity>
                                    <urn:Measurement>
                                        <urn:MeasurementValue>3000.000</urn:MeasurementValue>
                                        <urn:UnitOfMeasureCode Domain="UN-Rec-20">UN</urn:UnitOfMeasureCode>
                                    </urn:Measurement>
                                </urn:ProductQuantity>
                            </urn:PriceAndAvailabilityResponseProductLineItem>
                        </urn:PriceAndAvailabilityResponseDetails>
                    </urn:PriceAndAvailabilityResponseBody>
                </urn:PriceAndAvailabilityResponse>
            </ag:xmlPayload>
        </ag:outboundData>
    </soapenv:Body>
</soapenv:Envelope>